; ModuleID = 'prog.bpf.c'
source_filename = "prog.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.anon.5 = type { ptr, ptr, ptr, ptr }
%struct.state = type { i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32, i32 }
%struct.goto_result = type { i32, i32 }
%struct.data = type { [10 x i8], i32 }

@config = dso_local global %struct.anon.1 zeroinitializer, section ".maps", align 8, !dbg !0
@state_map = dso_local global %struct.anon.2 zeroinitializer, section ".maps", align 8, !dbg !268
@matchPayload.____fmt = internal constant [48 x i8] c"Continue to analyze packet from index %d to %d.\00", align 1, !dbg !85
@matchPayload.____fmt.1 = internal constant [51 x i8] c"Packet received. payload_size = %u. Let's process.\00", align 1, !dbg !200
@goto_func = dso_local global %struct.anon.3 zeroinitializer, section ".maps", align 8, !dbg !238
@strings = dso_local global %struct.anon.4 zeroinitializer, section ".maps", align 8, !dbg !222
@__const.matchPayload.fmt = private unnamed_addr constant [60 x i8] c"Found the word '%s'. It's the %dth packet with this string.\00", align 1
@.str = private unnamed_addr constant [13 x i8] c"Dropping...\0A\00", align 1, !dbg !205

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "config", scope: !2, file: !3, line: 16, type: !312, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !52, globals: !84, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "prog.bpf.c", directory: "/run/media/kaelsa/1tera/KaelMedia/KPrograms/GitHub/honey-potion/benchmarks/programs/findstring", checksumkind: CSK_MD5, checksum: "7f014747bd29115cc77399eb63a847cc")
!4 = !{!5, !14, !46}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 6130, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "b90a69f1fa9b9ccf0c666897a6f64ece")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2)
!12 = !DIEnumerator(name: "XDP_TX", value: 3)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 40, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "", checksumkind: CSK_MD5, checksum: "b19632dbf3144fab79301e846e1f6726")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!38 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!39 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!40 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!41 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!42 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!43 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!44 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!45 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 1224, baseType: !7, size: 32, elements: !47)
!47 = !{!48, !49, !50, !51}
!48 = !DIEnumerator(name: "BPF_ANY", value: 0)
!49 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!50 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!51 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!52 = !{!53, !54, !55, !57, !58, !67, !72, !81}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!54 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!57 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "state", file: !60, line: 23, size: 96, elements: !61)
!60 = !DIFile(filename: "./prog.h", directory: "/run/media/kaelsa/1tera/KaelMedia/KPrograms/GitHub/honey-potion/benchmarks/programs/findstring", checksumkind: CSK_MD5, checksum: "86ee1f43a43606cd00c380e81cf7288b")
!61 = !{!62, !65, !66}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "payload_index", scope: !59, file: !60, line: 24, baseType: !63, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !64, line: 27, baseType: !7)
!64 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "ac_state", scope: !59, file: !60, line: 25, baseType: !63, size: 32, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "matches", scope: !59, file: !60, line: 26, baseType: !63, size: 32, offset: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "goto_result", file: !60, line: 29, size: 64, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "next_state", scope: !68, file: !60, line: 30, baseType: !7, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "match", scope: !68, file: !60, line: 31, baseType: !7, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "data", file: !60, line: 11, size: 128, elements: !74)
!74 = !{!75, !80}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !73, file: !60, line: 12, baseType: !76, size: 80)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 80, elements: !78)
!77 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!78 = !{!79}
!79 = !DISubrange(count: 10)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !73, file: !60, line: 13, baseType: !56, size: 32, offset: 96)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !82, line: 40, baseType: !83)
!82 = !DIFile(filename: "/usr/include/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "4a64d909bcfa62a0a7682c3ac78c6965")
!83 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!84 = !{!85, !200, !205, !210, !215, !220, !0, !222, !238, !252, !268, !281, !289, !295, !302, !307}
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "____fmt", scope: !87, file: !3, line: 102, type: !196, isLocal: true, isDefinition: true)
!87 = distinct !DISubprogram(name: "matchPayload", scope: !3, file: !3, line: 56, type: !88, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !99)
!88 = !DISubroutineType(types: !89)
!89 = !{!56, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 6141, size: 192, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !98}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !6, line: 6142, baseType: !63, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !91, file: !6, line: 6143, baseType: !63, size: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !91, file: !6, line: 6144, baseType: !63, size: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !91, file: !6, line: 6146, baseType: !63, size: 32, offset: 96)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !91, file: !6, line: 6147, baseType: !63, size: 32, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "egress_ifindex", scope: !91, file: !6, line: 6149, baseType: !63, size: 32, offset: 160)
!99 = !{!100, !101, !102, !103, !118, !128, !157, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !172, !173, !174, !178, !183, !184, !190, !194, !195}
!100 = !DILocalVariable(name: "ctx", arg: 1, scope: !87, file: !3, line: 56, type: !90)
!101 = !DILocalVariable(name: "data_end", scope: !87, file: !3, line: 58, type: !53)
!102 = !DILocalVariable(name: "data", scope: !87, file: !3, line: 59, type: !53)
!103 = !DILocalVariable(name: "eth", scope: !87, file: !3, line: 60, type: !104)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !106, line: 173, size: 112, elements: !107)
!106 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!107 = !{!108, !113, !114}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !105, file: !106, line: 174, baseType: !109, size: 48)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 48, elements: !111)
!110 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !{!112}
!112 = !DISubrange(count: 6)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !105, file: !106, line: 175, baseType: !109, size: 48, offset: 48)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !105, file: !106, line: 176, baseType: !115, size: 16, offset: 96)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !116, line: 28, baseType: !117)
!116 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "64bcf4b731906682de6e750679b9f4a2")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !64, line: 24, baseType: !83)
!118 = !DILocalVariable(name: "udp", scope: !87, file: !3, line: 61, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !121, line: 23, size: 64, elements: !122)
!121 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "53c0d42e1bf6d93b39151764be2d20fb")
!122 = !{!123, !124, !125, !126}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !120, file: !121, line: 24, baseType: !115, size: 16)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !120, file: !121, line: 25, baseType: !115, size: 16, offset: 16)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !120, file: !121, line: 26, baseType: !115, size: 16, offset: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !120, file: !121, line: 27, baseType: !127, size: 16, offset: 48)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !116, line: 34, baseType: !117)
!128 = !DILocalVariable(name: "ip", scope: !87, file: !3, line: 62, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !131, line: 87, size: 160, elements: !132)
!131 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!132 = !{!133, !135, !136, !137, !138, !139, !140, !141, !142, !143}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !130, file: !131, line: 89, baseType: !134, size: 4, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !64, line: 21, baseType: !110)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !130, file: !131, line: 90, baseType: !134, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !130, file: !131, line: 97, baseType: !134, size: 8, offset: 8)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !130, file: !131, line: 98, baseType: !115, size: 16, offset: 16)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !130, file: !131, line: 99, baseType: !115, size: 16, offset: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !130, file: !131, line: 100, baseType: !115, size: 16, offset: 48)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !130, file: !131, line: 101, baseType: !134, size: 8, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !130, file: !131, line: 102, baseType: !134, size: 8, offset: 72)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !130, file: !131, line: 103, baseType: !127, size: 16, offset: 80)
!143 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !131, line: 104, baseType: !144, size: 64, offset: 96)
!144 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !131, line: 104, size: 64, elements: !145)
!145 = !{!146, !152}
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !144, file: !131, line: 104, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !131, line: 104, size: 64, elements: !148)
!148 = !{!149, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !147, file: !131, line: 104, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !116, line: 30, baseType: !63)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !147, file: !131, line: 104, baseType: !150, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !144, file: !131, line: 104, baseType: !153, size: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !144, file: !131, line: 104, size: 64, elements: !154)
!154 = !{!155, !156}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !153, file: !131, line: 104, baseType: !150, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !153, file: !131, line: 104, baseType: !150, size: 32, offset: 32)
!157 = !DILocalVariable(name: "payload", scope: !87, file: !3, line: 63, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!159 = !DILocalVariable(name: "payload_size", scope: !87, file: !3, line: 85, type: !7)
!160 = !DILocalVariable(name: "key", scope: !87, file: !3, line: 90, type: !77)
!161 = !DILocalVariable(name: "value", scope: !87, file: !3, line: 91, type: !55)
!162 = !DILocalVariable(name: "newstate", scope: !87, file: !3, line: 95, type: !59)
!163 = !DILocalVariable(name: "s", scope: !87, file: !3, line: 96, type: !58)
!164 = !DILocalVariable(name: "ctx_address", scope: !87, file: !3, line: 98, type: !57)
!165 = !DILocalVariable(name: "state_from_map", scope: !87, file: !3, line: 99, type: !58)
!166 = !DILocalVariable(name: "reached_end", scope: !87, file: !3, line: 113, type: !56)
!167 = !DILocalVariable(name: "i", scope: !87, file: !3, line: 114, type: !7)
!168 = !DILocalVariable(name: "payload_access", scope: !169, file: !3, line: 117, type: !7)
!169 = distinct !DILexicalBlock(scope: !170, file: !3, line: 116, column: 5)
!170 = distinct !DILexicalBlock(scope: !171, file: !3, line: 115, column: 5)
!171 = distinct !DILexicalBlock(scope: !87, file: !3, line: 115, column: 5)
!172 = !DILocalVariable(name: "go_from_state", scope: !169, file: !3, line: 125, type: !67)
!173 = !DILocalVariable(name: "ch", scope: !169, file: !3, line: 130, type: !7)
!174 = !DILocalVariable(name: "j", scope: !175, file: !3, line: 148, type: !56)
!175 = distinct !DILexicalBlock(scope: !176, file: !3, line: 148, column: 9)
!176 = distinct !DILexicalBlock(scope: !177, file: !3, line: 147, column: 21)
!177 = distinct !DILexicalBlock(scope: !87, file: !3, line: 147, column: 8)
!178 = !DILocalVariable(name: "key", scope: !179, file: !3, line: 152, type: !56)
!179 = distinct !DILexicalBlock(scope: !180, file: !3, line: 151, column: 13)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 150, column: 17)
!181 = distinct !DILexicalBlock(scope: !182, file: !3, line: 149, column: 9)
!182 = distinct !DILexicalBlock(scope: !175, file: !3, line: 148, column: 9)
!183 = !DILocalVariable(name: "word", scope: !179, file: !3, line: 153, type: !72)
!184 = !DILocalVariable(name: "fmt", scope: !185, file: !3, line: 156, type: !187)
!185 = distinct !DILexicalBlock(scope: !186, file: !3, line: 154, column: 26)
!186 = distinct !DILexicalBlock(scope: !179, file: !3, line: 154, column: 20)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 480, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 60)
!190 = !DILocalVariable(name: "clean_or_not", scope: !176, file: !3, line: 162, type: !191)
!191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 112, elements: !192)
!192 = !{!193}
!193 = !DISubrange(count: 14)
!194 = !DILocalVariable(name: "pass_or_not", scope: !176, file: !3, line: 163, type: !56)
!195 = !DILocalVariable(name: "key", scope: !176, file: !3, line: 173, type: !57)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 384, elements: !198)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!198 = !{!199}
!199 = !DISubrange(count: 48)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "____fmt", scope: !87, file: !3, line: 104, type: !202, isLocal: true, isDefinition: true)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 408, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 51)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(scope: null, file: !3, line: 166, type: !207, isLocal: true, isDefinition: true)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 104, elements: !208)
!208 = !{!209}
!209 = !DISubrange(count: 13)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(scope: null, file: !3, line: 169, type: !212, isLocal: true, isDefinition: true)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 96, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 12)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "____fmt", scope: !87, file: !3, line: 172, type: !217, isLocal: true, isDefinition: true)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 296, elements: !218)
!218 = !{!219}
!219 = !DISubrange(count: 37)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 184, type: !207, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "strings", scope: !2, file: !3, line: 24, type: !224, isLocal: false, isDefinition: true)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 18, size: 256, elements: !225)
!225 = !{!226, !231, !236, !237}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !224, file: !3, line: 20, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 64, elements: !229)
!229 = !{!230}
!230 = !DISubrange(count: 2)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !224, file: !3, line: 21, baseType: !232, size: 64, offset: 64)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 5)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !224, file: !3, line: 22, baseType: !55, size: 64, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !224, file: !3, line: 23, baseType: !72, size: 64, offset: 192)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "goto_func", scope: !2, file: !3, line: 32, type: !240, isLocal: false, isDefinition: true)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 26, size: 256, elements: !241)
!241 = !{!242, !243, !246, !247}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !3, line: 28, baseType: !227, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !240, file: !3, line: 29, baseType: !244, size: 64, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 1632, elements: !203)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !240, file: !3, line: 30, baseType: !55, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !240, file: !3, line: 31, baseType: !248, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1664, elements: !250)
!250 = !{!251}
!251 = !DISubrange(count: 26)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "progs", scope: !2, file: !3, line: 40, type: !254, isLocal: false, isDefinition: true)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 34, size: 256, elements: !255)
!255 = !{!256, !261, !266, !267}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !254, file: !3, line: 36, baseType: !257, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 96, elements: !259)
!259 = !{!260}
!260 = !DISubrange(count: 3)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !254, file: !3, line: 37, baseType: !262, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 32, elements: !264)
!264 = !{!265}
!265 = !DISubrange(count: 1)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !254, file: !3, line: 38, baseType: !55, size: 64, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !254, file: !3, line: 39, baseType: !55, size: 64, offset: 192)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "state_map", scope: !2, file: !3, line: 48, type: !270, isLocal: false, isDefinition: true)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 42, size: 256, elements: !271)
!271 = !{!272, !273, !278, !280}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !270, file: !3, line: 44, baseType: !262, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !270, file: !3, line: 45, baseType: !274, size: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 32000, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 1000)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !270, file: !3, line: 46, baseType: !279, size: 64, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !270, file: !3, line: 47, baseType: !58, size: 64, offset: 192)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !283, line: 51, type: !284, isLocal: true, isDefinition: true)
!283 = !DIFile(filename: "../../libs/libbpf/src/root/usr/include/bpf/bpf_helper_defs.h", directory: "/run/media/kaelsa/1tera/KaelMedia/KPrograms/GitHub/honey-potion/benchmarks/programs/findstring", checksumkind: CSK_MD5, checksum: "ad8ff3755106b533b446159c410c596d")
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DISubroutineType(types: !286)
!286 = !{!53, !53, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !283, line: 172, type: !291, isLocal: true, isDefinition: true)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!54, !294, !63, null}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !283, line: 73, type: !297, isLocal: true, isDefinition: true)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{!54, !53, !287, !287, !300}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !64, line: 31, baseType: !301)
!301 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !283, line: 83, type: !304, isLocal: true, isDefinition: true)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DISubroutineType(types: !306)
!306 = !{!54, !53, !287}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "bpf_tail_call", scope: !2, file: !283, line: 322, type: !309, isLocal: true, isDefinition: true)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DISubroutineType(types: !311)
!311 = !{!54, !53, !53, !63}
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 10, size: 256, elements: !313)
!313 = !{!314, !315, !316, !318}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !312, file: !3, line: 12, baseType: !262, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !312, file: !3, line: 13, baseType: !262, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !312, file: !3, line: 14, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !312, file: !3, line: 15, baseType: !55, size: 64, offset: 192)
!319 = !{i32 7, !"Dwarf Version", i32 5}
!320 = !{i32 2, !"Debug Info Version", i32 3}
!321 = !{i32 1, !"wchar_size", i32 4}
!322 = !{i32 7, !"frame-pointer", i32 2}
!323 = !{!"clang version 15.0.7"}
!324 = !DILocation(line: 0, scope: !87)
!325 = !DILocation(line: 58, column: 41, scope: !87)
!326 = !{!327, !328, i64 4}
!327 = !{!"xdp_md", !328, i64 0, !328, i64 4, !328, i64 8, !328, i64 12, !328, i64 16, !328, i64 20}
!328 = !{!"int", !329, i64 0}
!329 = !{!"omnipotent char", !330, i64 0}
!330 = !{!"Simple C/C++ TBAA"}
!331 = !DILocation(line: 58, column: 30, scope: !87)
!332 = !DILocation(line: 58, column: 22, scope: !87)
!333 = !DILocation(line: 59, column: 37, scope: !87)
!334 = !{!327, !328, i64 0}
!335 = !DILocation(line: 59, column: 26, scope: !87)
!336 = !DILocation(line: 59, column: 18, scope: !87)
!337 = !DILocation(line: 67, column: 21, scope: !338)
!338 = distinct !DILexicalBlock(scope: !87, file: !3, line: 67, column: 9)
!339 = !DILocation(line: 67, column: 36, scope: !338)
!340 = !DILocation(line: 67, column: 9, scope: !87)
!341 = !DILocation(line: 76, column: 13, scope: !342)
!342 = distinct !DILexicalBlock(scope: !87, file: !3, line: 76, column: 9)
!343 = !{!344, !329, i64 9}
!344 = !{!"iphdr", !329, i64 0, !329, i64 0, !329, i64 1, !345, i64 2, !345, i64 4, !345, i64 6, !329, i64 8, !329, i64 9, !345, i64 10, !329, i64 12}
!345 = !{!"short", !329, i64 0}
!346 = !DILocation(line: 76, column: 22, scope: !342)
!347 = !DILocation(line: 76, column: 9, scope: !87)
!348 = !DILocation(line: 81, column: 21, scope: !349)
!349 = distinct !DILexicalBlock(scope: !87, file: !3, line: 81, column: 9)
!350 = !DILocation(line: 81, column: 36, scope: !349)
!351 = !DILocation(line: 81, column: 9, scope: !87)
!352 = !DILocation(line: 85, column: 33, scope: !87)
!353 = !{!354, !345, i64 4}
!354 = !{!"udphdr", !345, i64 0, !345, i64 2, !345, i64 4, !345, i64 6}
!355 = !DILocation(line: 85, column: 49, scope: !87)
!356 = !DILocation(line: 86, column: 25, scope: !357)
!357 = distinct !DILexicalBlock(scope: !87, file: !3, line: 86, column: 9)
!358 = !DILocation(line: 86, column: 40, scope: !357)
!359 = !DILocation(line: 86, column: 9, scope: !87)
!360 = !DILocation(line: 90, column: 5, scope: !87)
!361 = !DILocation(line: 90, column: 10, scope: !87)
!362 = !{!329, !329, i64 0}
!363 = !DILocation(line: 91, column: 25, scope: !87)
!364 = !DILocation(line: 92, column: 15, scope: !365)
!365 = distinct !DILexicalBlock(scope: !87, file: !3, line: 92, column: 9)
!366 = !DILocation(line: 92, column: 23, scope: !365)
!367 = !DILocation(line: 92, column: 31, scope: !365)
!368 = !{!354, !345, i64 2}
!369 = !DILocation(line: 92, column: 39, scope: !365)
!370 = !{!328, !328, i64 0}
!371 = !DILocation(line: 92, column: 36, scope: !365)
!372 = !DILocation(line: 92, column: 9, scope: !87)
!373 = !DILocation(line: 95, column: 5, scope: !87)
!374 = !DILocation(line: 95, column: 18, scope: !87)
!375 = !DILocation(line: 98, column: 5, scope: !87)
!376 = !DILocation(line: 98, column: 33, scope: !87)
!377 = !DILocation(line: 98, column: 19, scope: !87)
!378 = !{!379, !379, i64 0}
!379 = !{!"long", !329, i64 0}
!380 = !DILocation(line: 99, column: 52, scope: !87)
!381 = !DILocation(line: 100, column: 8, scope: !382)
!382 = distinct !DILexicalBlock(scope: !87, file: !3, line: 100, column: 8)
!383 = !DILocation(line: 100, column: 8, scope: !87)
!384 = !DILocation(line: 102, column: 9, scope: !385)
!385 = distinct !DILexicalBlock(scope: !386, file: !3, line: 102, column: 9)
!386 = distinct !DILexicalBlock(scope: !382, file: !3, line: 100, column: 24)
!387 = !{!388, !328, i64 0}
!388 = !{!"state", !328, i64 0, !328, i64 4, !328, i64 8}
!389 = !DILocation(line: 103, column: 5, scope: !386)
!390 = !DILocation(line: 104, column: 9, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !3, line: 104, column: 9)
