; ModuleID = '/home/vinicius/honey-potion/test_cases/lib/src/Cond.bpf.c'
source_filename = "/home/vinicius/honey-potion/test_cases/lib/src/Cond.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.OpResult = type { %struct.Generic, i32, [150 x i8] }
%struct.Generic = type { i32, %union.ElixirValue }
%union.ElixirValue = type { i64, [8 x i8] }

@LICENSE = dso_local global [13 x i8] c"Dual BSD/GPL\00", section "license", align 1, !dbg !0
@string_pool_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !50
@.str = private unnamed_addr constant [150 x i8] c"(UnexpectedBehavior) something wrong happened inside the Elixir runtime for eBPF. (can't access string pool, main function).\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 4, !dbg !20
@string_pool_index_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !72

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LICENSE", scope: !2, file: !22, line: 25, type: !142, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Homebrew clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/vinicius/honey-potion/test_cases/lib/src/Cond.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "565c351f3e6a2327e0e9e05ec743d7ed")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", file: !6, line: 40, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "_build/dev/lib/honey/priv/c_boilerplates/runtime_generic.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "699e26b6150612b5cee9098b6ccdafaf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "INVALID_TYPE", value: 0)
!10 = !DIEnumerator(name: "PATTERN_M", value: 1)
!11 = !DIEnumerator(name: "INTEGER", value: 2)
!12 = !DIEnumerator(name: "DOUBLE", value: 3)
!13 = !DIEnumerator(name: "STRING", value: 4)
!14 = !DIEnumerator(name: "ATOM", value: 5)
!15 = !DIEnumerator(name: "TUPLE", value: 6)
!16 = !DIEnumerator(name: "LIST", value: 7)
!17 = !DIEnumerator(name: "STRUCT", value: 8)
!18 = !DIEnumerator(name: "TYPE_Syscalls_enter_kill_arg", value: 9)
!19 = !{!0, !20, !27, !29, !34, !39, !44, !46, !48, !50, !72, !80, !92, !100, !112, !120, !129, !132}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(scope: null, file: !22, line: 42, type: !23, isLocal: true, isDefinition: true)
!22 = !DIFile(filename: "src/Cond.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "565c351f3e6a2327e0e9e05ec743d7ed")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1200, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 150)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !22, line: 49, type: !23, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !22, line: 54, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 4)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !22, line: 55, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !22, line: 56, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 5)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !22, line: 61, type: !23, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !22, line: 68, type: !23, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !22, line: 173, type: !23, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "string_pool_map", scope: !2, file: !52, line: 19, type: !53, isLocal: false, isDefinition: true)
!52 = !DIFile(filename: "_build/dev/lib/honey/priv/c_boilerplates/runtime_structures.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "c2bd38c05cd37ff863c88000051eef3c")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 13, size: 256, elements: !54)
!54 = !{!55, !59, !64, !67}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !53, file: !52, line: 15, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 192, elements: !37)
!58 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !53, file: !52, line: 16, baseType: !60, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 1)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !53, file: !52, line: 17, baseType: !65, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !53, file: !52, line: 18, baseType: !68, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 16000, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 500)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "string_pool_index_map", scope: !2, file: !52, line: 27, type: !74, isLocal: false, isDefinition: true)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 21, size: 256, elements: !75)
!75 = !{!76, !77, !78, !79}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !74, file: !52, line: 23, baseType: !56, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !74, file: !52, line: 24, baseType: !60, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !74, file: !52, line: 25, baseType: !65, size: 64, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !74, file: !52, line: 26, baseType: !65, size: 64, offset: 192)
!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(name: "tuple_pool_map", scope: !2, file: !52, line: 36, type: !82, isLocal: false, isDefinition: true)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 30, size: 256, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !52, line: 32, baseType: !56, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !82, file: !52, line: 33, baseType: !60, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !82, file: !52, line: 34, baseType: !65, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !82, file: !52, line: 35, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 64000, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 2000)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "tuple_pool_index_map", scope: !2, file: !52, line: 44, type: !94, isLocal: false, isDefinition: true)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 38, size: 256, elements: !95)
!95 = !{!96, !97, !98, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !94, file: !52, line: 40, baseType: !56, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !94, file: !52, line: 41, baseType: !60, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !94, file: !52, line: 42, baseType: !65, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !94, file: !52, line: 43, baseType: !65, size: 64, offset: 192)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "heap_map", scope: !2, file: !52, line: 53, type: !102, isLocal: false, isDefinition: true)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 47, size: 256, elements: !103)
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !102, file: !52, line: 49, baseType: !56, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !102, file: !52, line: 50, baseType: !60, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !102, file: !52, line: 51, baseType: !65, size: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !102, file: !52, line: 52, baseType: !108, size: 64, offset: 192)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 76800, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 2400)
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "heap_index_map", scope: !2, file: !52, line: 61, type: !114, isLocal: false, isDefinition: true)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !52, line: 55, size: 256, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !52, line: 57, baseType: !56, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !114, file: !52, line: 58, baseType: !60, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !114, file: !52, line: 59, baseType: !65, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !114, file: !52, line: 60, baseType: !65, size: 64, offset: 192)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !122, line: 50, type: !123, isLocal: true, isDefinition: true)
!122 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "eadf4a8bcf7ac4e7bd6d2cb666452242")
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !126, !127}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(scope: null, file: !131, line: 303, type: !23, isLocal: true, isDefinition: true)
!131 = !DIFile(filename: "_build/dev/lib/honey/priv/c_boilerplates/runtime_functions.bpf.c", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "b230f5be759074326648f496f90fd18a")
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !122, line: 171, type: !134, isLocal: true, isDefinition: true)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!137, !138, !140, null}
!137 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !141, line: 27, baseType: !7)
!141 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 104, elements: !143)
!143 = !{!144}
!144 = !DISubrange(count: 13)
!145 = !{i32 7, !"Dwarf Version", i32 5}
!146 = !{i32 2, !"Debug Info Version", i32 3}
!147 = !{i32 1, !"wchar_size", i32 4}
!148 = !{i32 7, !"frame-pointer", i32 2}
!149 = !{!"Homebrew clang version 15.0.7"}
!150 = distinct !DISubprogram(name: "main_func", scope: !22, file: !22, line: 30, type: !151, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !167)
!151 = !DISubroutineType(types: !152)
!152 = !{!58, !153}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscalls_enter_args", file: !22, line: 23, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syscalls_enter_args", file: !22, line: 11, size: 512, elements: !156)
!156 = !{!157, !159, !161, !162, !163, !164}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "common_type", scope: !155, file: !22, line: 17, baseType: !158, size: 16)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "common_flags", scope: !155, file: !22, line: 18, baseType: !160, size: 8, offset: 16)
!160 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "common_preempt_count", scope: !155, file: !22, line: 19, baseType: !160, size: 8, offset: 24)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "common_pid", scope: !155, file: !22, line: 20, baseType: !58, size: 32, offset: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !155, file: !22, line: 21, baseType: !137, size: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !155, file: !22, line: 22, baseType: !165, size: 384, offset: 128)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 384, elements: !37)
!166 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!167 = !{!168, !169, !177, !178, !179, !219, !220, !223, !225, !230, !231, !234, !235, !236, !237, !238, !239, !240, !247, !248, !250, !251, !258, !259, !261, !262, !266, !267, !269, !270, !274, !275, !277, !278}
!168 = !DILocalVariable(name: "ctx_arg", arg: 1, scope: !150, file: !22, line: 30, type: !153)
!169 = !DILocalVariable(name: "str_param1", scope: !150, file: !22, line: 32, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrFormatSpec", file: !6, line: 105, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StrFormatSpec", file: !6, line: 102, size: 16, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !171, file: !6, line: 104, baseType: !174, size: 16)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DILocalVariable(name: "str_param2", scope: !150, file: !22, line: 33, type: !170)
!178 = !DILocalVariable(name: "str_param3", scope: !150, file: !22, line: 34, type: !170)
!179 = !DILocalVariable(name: "op_result", scope: !150, file: !22, line: 36, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpResult", file: !6, line: 100, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpResult", file: !6, line: 95, size: 1472, elements: !182)
!182 = !{!183, !217, !218}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "result_var", scope: !181, file: !6, line: 97, baseType: !184, size: 192)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "Generic", file: !6, line: 93, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Generic", file: !6, line: 89, size: 192, elements: !186)
!186 = !{!187, !189}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !185, file: !6, line: 91, baseType: !188, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !6, line: 52, baseType: !5)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !185, file: !6, line: 92, baseType: !190, size: 128, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElixirValue", file: !6, line: 87, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ElixirValue", file: !6, line: 79, size: 128, elements: !192)
!192 = !{!193, !194, !195, !197, !203, !209}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !191, file: !6, line: 81, baseType: !137, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "u_integer", scope: !191, file: !6, line: 82, baseType: !7, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "double_precision", scope: !191, file: !6, line: 83, baseType: !196, size: 64)
!196 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !191, file: !6, line: 84, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tuple", file: !6, line: 58, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", file: !6, line: 54, size: 64, elements: !200)
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !199, file: !6, line: 56, baseType: !58, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !199, file: !6, line: 57, baseType: !58, size: 32, offset: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !191, file: !6, line: 85, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !6, line: 64, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !6, line: 60, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !205, file: !6, line: 62, baseType: !58, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !205, file: !6, line: 63, baseType: !58, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "syscalls_enter_kill_args", scope: !191, file: !6, line: 86, baseType: !210, size: 128)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_Syscalls_enter_kill_args", file: !6, line: 77, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_Syscalls_enter_kill_args", file: !6, line: 71, size: 128, elements: !212)
!212 = !{!213, !214, !215, !216}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pad", scope: !211, file: !6, line: 73, baseType: !7, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "pos_syscall_nr", scope: !211, file: !6, line: 74, baseType: !7, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pid", scope: !211, file: !6, line: 75, baseType: !7, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pos_sig", scope: !211, file: !6, line: 76, baseType: !7, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !181, file: !6, line: 98, baseType: !58, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "exception_msg", scope: !181, file: !6, line: 99, baseType: !23, size: 1200, offset: 224)
!219 = !DILocalVariable(name: "zero", scope: !150, file: !22, line: 38, type: !58)
!220 = !DILocalVariable(name: "string_pool", scope: !150, file: !22, line: 39, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4000, elements: !70)
!223 = !DILocalVariable(name: "string_pool_index", scope: !150, file: !22, line: 46, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!225 = !DILocalVariable(name: "heap", scope: !150, file: !22, line: 58, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 19200, elements: !228)
!228 = !{!229}
!229 = !DISubrange(count: 100)
!230 = !DILocalVariable(name: "heap_index", scope: !150, file: !22, line: 65, type: !224)
!231 = !DILocalVariable(name: "tuple_pool", scope: !150, file: !22, line: 73, type: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16000, elements: !70)
!234 = !DILocalVariable(name: "tuple_pool_index", scope: !150, file: !22, line: 80, type: !224)
!235 = !DILocalVariable(name: "helper_var_196", scope: !150, file: !22, line: 92, type: !184)
!236 = !DILocalVariable(name: "x_0_", scope: !150, file: !22, line: 94, type: !184)
!237 = !DILocalVariable(name: "helper_var_260", scope: !150, file: !22, line: 102, type: !184)
!238 = !DILocalVariable(name: "helper_var_324", scope: !150, file: !22, line: 106, type: !184)
!239 = !DILocalVariable(name: "helper_var_388", scope: !150, file: !22, line: 107, type: !184)
!240 = !DILocalVariable(name: "____fmt", scope: !241, file: !22, line: 112, type: !244)
!241 = distinct !DILexicalBlock(scope: !242, file: !22, line: 112, column: 1)
!242 = distinct !DILexicalBlock(scope: !243, file: !22, line: 109, column: 31)
!243 = distinct !DILexicalBlock(scope: !150, file: !22, line: 109, column: 5)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 56, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 7)
!247 = !DILocalVariable(name: "helper_var_452", scope: !242, file: !22, line: 113, type: !184)
!248 = !DILocalVariable(name: "helper_var_516", scope: !249, file: !22, line: 120, type: !184)
!249 = distinct !DILexicalBlock(scope: !243, file: !22, line: 116, column: 8)
!250 = !DILocalVariable(name: "helper_var_580", scope: !249, file: !22, line: 121, type: !184)
!251 = !DILocalVariable(name: "____fmt", scope: !252, file: !22, line: 126, type: !255)
!252 = distinct !DILexicalBlock(scope: !253, file: !22, line: 126, column: 1)
!253 = distinct !DILexicalBlock(scope: !254, file: !22, line: 123, column: 31)
!254 = distinct !DILexicalBlock(scope: !249, file: !22, line: 123, column: 5)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 80, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 10)
!258 = !DILocalVariable(name: "helper_var_644", scope: !253, file: !22, line: 127, type: !184)
!259 = !DILocalVariable(name: "helper_var_708", scope: !260, file: !22, line: 134, type: !184)
!260 = distinct !DILexicalBlock(scope: !254, file: !22, line: 130, column: 8)
!261 = !DILocalVariable(name: "helper_var_772", scope: !260, file: !22, line: 135, type: !184)
!262 = !DILocalVariable(name: "____fmt", scope: !263, file: !22, line: 140, type: !255)
!263 = distinct !DILexicalBlock(scope: !264, file: !22, line: 140, column: 1)
!264 = distinct !DILexicalBlock(scope: !265, file: !22, line: 137, column: 31)
!265 = distinct !DILexicalBlock(scope: !260, file: !22, line: 137, column: 5)
!266 = !DILocalVariable(name: "helper_var_836", scope: !264, file: !22, line: 141, type: !184)
!267 = !DILocalVariable(name: "helper_var_900", scope: !268, file: !22, line: 148, type: !184)
