; ModuleID = '/home/vinicius/honey-potion/test_cases/lib/src/Honey_Tuple.bpf.c'
source_filename = "/home/vinicius/honey-potion/test_cases/lib/src/Honey_Tuple.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.Generic = type { i32, %union.ElixirValue }
%union.ElixirValue = type { i64, [8 x i8] }
%struct.OpResult = type { %struct.Generic, i32, [150 x i8] }

@LICENSE = dso_local global [13 x i8] c"Dual BSD/GPL\00", section "license", align 1, !dbg !0
@string_pool_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !67
@.str = private unnamed_addr constant [150 x i8] c"(UnexpectedBehavior) something wrong happened inside the Elixir runtime for eBPF. (can't access string pool, main function).\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 4, !dbg !20
@string_pool_index_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !89

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Homebrew clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/vinicius/honey-potion/test_cases/lib/src/Honey_Tuple.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "8c15de2b31478dd9284b3d3f4c61518c")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", file: !6, line: 40, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: ".elixir_ls/build/test/lib/honey/priv/c_boilerplates/runtime_generic.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "699e26b6150612b5cee9098b6ccdafaf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "INVALID_TYPE", value: 0)
!10 = !DIEnumerator(name: "PATTERN_M", value: 1)
!11 = !DIEnumerator(name: "INTEGER", value: 2)
!12 = !DIEnumerator(name: "DOUBLE", value: 3)
!13 = !DIEnumerator(name: "STRING", value: 4)
!14 = !DIEnumerator(name: "ATOM", value: 5)
!15 = !DIEnumerator(name: "TUPLE", value: 6)
!16 = !DIEnumerator(name: "LIST", value: 7)
!17 = !DIEnumerator(name: "STRUCT", value: 8)
!18 = !DIEnumerator(name: "TYPE_Syscalls_enter_kill_arg", value: 9)
!19 = !{!0, !20, !27, !29, !34, !39, !44, !46, !48, !50, !55, !57, !59, !61, !63, !65, !67, !89, !97, !109, !117, !129, !137, !146}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(scope: null, file: !22, line: 41, type: !23, isLocal: true, isDefinition: true)
!22 = !DIFile(filename: "src/Honey_Tuple.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "8c15de2b31478dd9284b3d3f4c61518c")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1200, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 150)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !22, line: 48, type: !23, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !22, line: 53, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 4)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !22, line: 54, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !22, line: 55, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 5)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !22, line: 60, type: !23, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !22, line: 67, type: !23, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !22, line: 100, type: !23, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !22, line: 105, type: !52, isLocal: true, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 96, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 12)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(scope: null, file: !22, line: 115, type: !23, isLocal: true, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(scope: null, file: !22, line: 121, type: !23, isLocal: true, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(scope: null, file: !22, line: 201, type: !23, isLocal: true, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !22, line: 210, type: !23, isLocal: true, isDefinition: true)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(scope: null, file: !22, line: 214, type: !23, isLocal: true, isDefinition: true)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(scope: null, file: !22, line: 390, type: !23, isLocal: true, isDefinition: true)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(name: "string_pool_map", scope: !2, file: !69, line: 19, type: !70, isLocal: false, isDefinition: true)
!69 = !DIFile(filename: ".elixir_ls/build/test/lib/honey/priv/c_boilerplates/runtime_structures.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "c2bd38c05cd37ff863c88000051eef3c")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 13, size: 256, elements: !71)
!71 = !{!72, !76, !81, !84}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !70, file: !69, line: 15, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 192, elements: !37)
!75 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !70, file: !69, line: 16, baseType: !77, size: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 32, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 1)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !70, file: !69, line: 17, baseType: !82, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !70, file: !69, line: 18, baseType: !85, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 16000, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 500)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(name: "string_pool_index_map", scope: !2, file: !69, line: 27, type: !91, isLocal: false, isDefinition: true)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 21, size: 256, elements: !92)
!92 = !{!93, !94, !95, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !69, line: 23, baseType: !73, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !91, file: !69, line: 24, baseType: !77, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !91, file: !69, line: 25, baseType: !82, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !91, file: !69, line: 26, baseType: !82, size: 64, offset: 192)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "tuple_pool_map", scope: !2, file: !69, line: 36, type: !99, isLocal: false, isDefinition: true)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 30, size: 256, elements: !100)
!100 = !{!101, !102, !103, !104}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !99, file: !69, line: 32, baseType: !73, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !99, file: !69, line: 33, baseType: !77, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !99, file: !69, line: 34, baseType: !82, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !99, file: !69, line: 35, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 64000, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 2000)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "tuple_pool_index_map", scope: !2, file: !69, line: 44, type: !111, isLocal: false, isDefinition: true)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 38, size: 256, elements: !112)
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !111, file: !69, line: 40, baseType: !73, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !111, file: !69, line: 41, baseType: !77, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !111, file: !69, line: 42, baseType: !82, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !111, file: !69, line: 43, baseType: !82, size: 64, offset: 192)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "heap_map", scope: !2, file: !69, line: 53, type: !119, isLocal: false, isDefinition: true)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 47, size: 256, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !119, file: !69, line: 49, baseType: !73, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !119, file: !69, line: 50, baseType: !77, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !119, file: !69, line: 51, baseType: !82, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !119, file: !69, line: 52, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 76800, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 2400)
!129 = !DIGlobalVariableExpression(var: !130, expr: !DIExpression())
!130 = distinct !DIGlobalVariable(name: "heap_index_map", scope: !2, file: !69, line: 61, type: !131, isLocal: false, isDefinition: true)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !69, line: 55, size: 256, elements: !132)
!132 = !{!133, !134, !135, !136}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !131, file: !69, line: 57, baseType: !73, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !131, file: !69, line: 58, baseType: !77, size: 64, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !131, file: !69, line: 59, baseType: !82, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !131, file: !69, line: 60, baseType: !82, size: 64, offset: 192)
!137 = !DIGlobalVariableExpression(var: !138, expr: !DIExpression())
!138 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !139, line: 50, type: !140, isLocal: true, isDefinition: true)
!139 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "eadf4a8bcf7ac4e7bd6d2cb666452242")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !143, !144}
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !139, line: 171, type: !148, isLocal: true, isDefinition: true)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !152, !154, null}
!151 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !155, line: 27, baseType: !7)
!155 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 104, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 13)
!159 = !{i32 7, !"Dwarf Version", i32 5}
!160 = !{i32 2, !"Debug Info Version", i32 3}
!161 = !{i32 1, !"wchar_size", i32 4}
!162 = !{i32 7, !"frame-pointer", i32 2}
!163 = !{!"Homebrew clang version 15.0.7"}
!164 = distinct !DISubprogram(name: "main_func", scope: !22, file: !22, line: 29, type: !165, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !176)
!165 = !DISubroutineType(types: !166)
!166 = !{!75, !167}
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscalls_enter_kill_args", file: !22, line: 22, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syscalls_enter_kill_args", file: !22, line: 11, size: 256, elements: !170)
!170 = !{!171, !173, !174, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !169, file: !22, line: 17, baseType: !172, size: 64)
!172 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_nr", scope: !169, file: !22, line: 19, baseType: !151, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !169, file: !22, line: 20, baseType: !151, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !169, file: !22, line: 21, baseType: !151, size: 64, offset: 192)
!176 = !{!177, !178, !186, !187, !188, !228, !229, !232, !234, !239, !240, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !257, !258, !261, !262, !265, !266, !269, !270, !273, !274, !275, !278, !279, !281, !282, !287, !288}
!177 = !DILocalVariable(name: "ctx_arg", arg: 1, scope: !164, file: !22, line: 29, type: !167)
!178 = !DILocalVariable(name: "str_param1", scope: !164, file: !22, line: 31, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrFormatSpec", file: !6, line: 105, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StrFormatSpec", file: !6, line: 102, size: 16, elements: !181)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !180, file: !6, line: 104, baseType: !183, size: 16)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 2)
!186 = !DILocalVariable(name: "str_param2", scope: !164, file: !22, line: 32, type: !179)
!187 = !DILocalVariable(name: "str_param3", scope: !164, file: !22, line: 33, type: !179)
!188 = !DILocalVariable(name: "op_result", scope: !164, file: !22, line: 35, type: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpResult", file: !6, line: 100, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpResult", file: !6, line: 95, size: 1472, elements: !191)
!191 = !{!192, !226, !227}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "result_var", scope: !190, file: !6, line: 97, baseType: !193, size: 192)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "Generic", file: !6, line: 93, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Generic", file: !6, line: 89, size: 192, elements: !195)
!195 = !{!196, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !6, line: 91, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !6, line: 52, baseType: !5)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !194, file: !6, line: 92, baseType: !199, size: 128, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElixirValue", file: !6, line: 87, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ElixirValue", file: !6, line: 79, size: 128, elements: !201)
!201 = !{!202, !203, !204, !206, !212, !218}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !200, file: !6, line: 81, baseType: !151, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "u_integer", scope: !200, file: !6, line: 82, baseType: !7, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "double_precision", scope: !200, file: !6, line: 83, baseType: !205, size: 64)
!205 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !200, file: !6, line: 84, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tuple", file: !6, line: 58, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", file: !6, line: 54, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !208, file: !6, line: 56, baseType: !75, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !208, file: !6, line: 57, baseType: !75, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !200, file: !6, line: 85, baseType: !213, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !6, line: 64, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !6, line: 60, size: 64, elements: !215)
!215 = !{!216, !217}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !214, file: !6, line: 62, baseType: !75, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !214, file: !6, line: 63, baseType: !75, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "syscalls_enter_kill_args", scope: !200, file: !6, line: 86, baseType: !219, size: 128)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_Syscalls_enter_kill_args", file: !6, line: 77, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_Syscalls_enter_kill_args", file: !6, line: 71, size: 128, elements: !221)
!221 = !{!222, !223, !224, !225}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pad", scope: !220, file: !6, line: 73, baseType: !7, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "pos_syscall_nr", scope: !220, file: !6, line: 74, baseType: !7, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pid", scope: !220, file: !6, line: 75, baseType: !7, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pos_sig", scope: !220, file: !6, line: 76, baseType: !7, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !190, file: !6, line: 98, baseType: !75, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "exception_msg", scope: !190, file: !6, line: 99, baseType: !23, size: 1200, offset: 224)
!228 = !DILocalVariable(name: "zero", scope: !164, file: !22, line: 37, type: !75)
!229 = !DILocalVariable(name: "string_pool", scope: !164, file: !22, line: 38, type: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4000, elements: !87)
!232 = !DILocalVariable(name: "string_pool_index", scope: !164, file: !22, line: 45, type: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!234 = !DILocalVariable(name: "heap", scope: !164, file: !22, line: 57, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 19200, elements: !237)
!237 = !{!238}
!238 = !DISubrange(count: 100)
!239 = !DILocalVariable(name: "heap_index", scope: !164, file: !22, line: 64, type: !233)
!240 = !DILocalVariable(name: "tuple_pool", scope: !164, file: !22, line: 72, type: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16000, elements: !87)
!243 = !DILocalVariable(name: "tuple_pool_index", scope: !164, file: !22, line: 79, type: !233)
!244 = !DILocalVariable(name: "helper_var_4675", scope: !164, file: !22, line: 92, type: !193)
!245 = !DILocalVariable(name: "helper_var_4739", scope: !164, file: !22, line: 94, type: !193)
!246 = !DILocalVariable(name: "len_helper_var_4867", scope: !164, file: !22, line: 97, type: !7)
!247 = !DILocalVariable(name: "end_helper_var_4867", scope: !164, file: !22, line: 98, type: !7)
!248 = !DILocalVariable(name: "helper_var_4803", scope: !164, file: !22, line: 108, type: !193)
!249 = !DILocalVariable(name: "helper_var_4931", scope: !164, file: !22, line: 111, type: !193)
!250 = !DILocalVariable(name: "helper_var_4995", scope: !164, file: !22, line: 139, type: !193)
!251 = !DILocalVariable(name: "helper_var_5059", scope: !164, file: !22, line: 168, type: !193)
!252 = !DILocalVariable(name: "helper_var_5123", scope: !164, file: !22, line: 197, type: !193)
!253 = !DILocalVariable(name: "helper_var_5187", scope: !164, file: !22, line: 204, type: !193)
!254 = !DILocalVariable(name: "helper_var_5251", scope: !255, file: !22, line: 206, type: !7)
!255 = distinct !DILexicalBlock(scope: !256, file: !22, line: 205, column: 106)
!256 = distinct !DILexicalBlock(scope: !164, file: !22, line: 205, column: 4)
!257 = !DILocalVariable(name: "helper_var_5315", scope: !164, file: !22, line: 221, type: !193)
!258 = !DILocalVariable(name: "helper_var_5379", scope: !259, file: !22, line: 223, type: !7)
!259 = distinct !DILexicalBlock(scope: !260, file: !22, line: 222, column: 106)
!260 = distinct !DILexicalBlock(scope: !164, file: !22, line: 222, column: 4)
!261 = !DILocalVariable(name: "helper_var_5443", scope: !164, file: !22, line: 238, type: !193)
!262 = !DILocalVariable(name: "helper_var_5507", scope: !263, file: !22, line: 240, type: !7)
!263 = distinct !DILexicalBlock(scope: !264, file: !22, line: 239, column: 106)
!264 = distinct !DILexicalBlock(scope: !164, file: !22, line: 239, column: 4)
!265 = !DILocalVariable(name: "helper_var_5571", scope: !164, file: !22, line: 255, type: !193)
!266 = !DILocalVariable(name: "helper_var_5635", scope: !267, file: !22, line: 257, type: !7)
!267 = distinct !DILexicalBlock(scope: !268, file: !22, line: 256, column: 106)
!268 = distinct !DILexicalBlock(scope: !164, file: !22, line: 256, column: 4)
!269 = !DILocalVariable(name: "helper_var_5699", scope: !164, file: !22, line: 272, type: !193)
!270 = !DILocalVariable(name: "helper_var_5763", scope: !271, file: !22, line: 274, type: !7)
!271 = distinct !DILexicalBlock(scope: !272, file: !22, line: 273, column: 106)
!272 = distinct !DILexicalBlock(scope: !164, file: !22, line: 273, column: 4)
