; ModuleID = '/home/vinicius/honey-potion/test_cases/lib/src/Honey_Maps.bpf.c'
source_filename = "/home/vinicius/honey-potion/test_cases/lib/src/Honey_Maps.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.anon.5 = type { ptr, ptr, ptr, ptr }
%struct.Generic = type { i32, %union.ElixirValue }
%union.ElixirValue = type { i64, [8 x i8] }
%struct.OpResult = type { %struct.Generic, i32, [150 x i8] }

@LICENSE = dso_local global [13 x i8] c"Dual BSD/GPL\00", section "license", align 1, !dbg !0
@string_pool_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !56
@.str = private unnamed_addr constant [150 x i8] c"(UnexpectedBehavior) something wrong happened inside the Elixir runtime for eBPF. (can't access string pool, main function).\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 4, !dbg !20
@string_pool_index_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !78

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LICENSE", scope: !2, file: !22, line: 35, type: !181, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Homebrew clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/vinicius/honey-potion/test_cases/lib/src/Honey_Maps.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "7f3a537d084bef9cb9af36d99b175227")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", file: !6, line: 40, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "_build/dev/lib/honey/priv/c_boilerplates/runtime_generic.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "699e26b6150612b5cee9098b6ccdafaf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "INVALID_TYPE", value: 0)
!10 = !DIEnumerator(name: "PATTERN_M", value: 1)
!11 = !DIEnumerator(name: "INTEGER", value: 2)
!12 = !DIEnumerator(name: "DOUBLE", value: 3)
!13 = !DIEnumerator(name: "STRING", value: 4)
!14 = !DIEnumerator(name: "ATOM", value: 5)
!15 = !DIEnumerator(name: "TUPLE", value: 6)
!16 = !DIEnumerator(name: "LIST", value: 7)
!17 = !DIEnumerator(name: "STRUCT", value: 8)
!18 = !DIEnumerator(name: "TYPE_Syscalls_enter_kill_arg", value: 9)
!19 = !{!0, !20, !27, !29, !34, !39, !44, !46, !48, !50, !52, !54, !56, !78, !86, !98, !106, !118, !126, !146, !155, !158, !160, !162, !164, !173}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(scope: null, file: !22, line: 52, type: !23, isLocal: true, isDefinition: true)
!22 = !DIFile(filename: "src/Honey_Maps.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "7f3a537d084bef9cb9af36d99b175227")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1200, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 150)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !22, line: 59, type: !23, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !22, line: 64, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 4)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !22, line: 65, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !22, line: 66, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 5)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !22, line: 71, type: !23, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !22, line: 78, type: !23, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !22, line: 105, type: !23, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !22, line: 116, type: !23, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !22, line: 289, type: !23, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !22, line: 328, type: !23, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "string_pool_map", scope: !2, file: !58, line: 19, type: !59, isLocal: false, isDefinition: true)
!58 = !DIFile(filename: "_build/dev/lib/honey/priv/c_boilerplates/runtime_structures.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "c2bd38c05cd37ff863c88000051eef3c")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 13, size: 256, elements: !60)
!60 = !{!61, !65, !70, !73}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !58, line: 15, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !37)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !59, file: !58, line: 16, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !59, file: !58, line: 17, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !59, file: !58, line: 18, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 16000, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 500)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "string_pool_index_map", scope: !2, file: !58, line: 27, type: !80, isLocal: false, isDefinition: true)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 21, size: 256, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !58, line: 23, baseType: !62, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !58, line: 24, baseType: !66, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !58, line: 25, baseType: !71, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !58, line: 26, baseType: !71, size: 64, offset: 192)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "tuple_pool_map", scope: !2, file: !58, line: 36, type: !88, isLocal: false, isDefinition: true)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 30, size: 256, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !58, line: 32, baseType: !62, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !88, file: !58, line: 33, baseType: !66, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !88, file: !58, line: 34, baseType: !71, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !88, file: !58, line: 35, baseType: !94, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64000, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2000)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "tuple_pool_index_map", scope: !2, file: !58, line: 44, type: !100, isLocal: false, isDefinition: true)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 38, size: 256, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !58, line: 40, baseType: !62, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !100, file: !58, line: 41, baseType: !66, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !100, file: !58, line: 42, baseType: !71, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !100, file: !58, line: 43, baseType: !71, size: 64, offset: 192)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "heap_map", scope: !2, file: !58, line: 53, type: !108, isLocal: false, isDefinition: true)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 47, size: 256, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !58, line: 49, baseType: !62, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !108, file: !58, line: 50, baseType: !66, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !108, file: !58, line: 51, baseType: !71, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !108, file: !58, line: 52, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 76800, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 2400)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "heap_index_map", scope: !2, file: !58, line: 61, type: !120, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 55, size: 256, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !58, line: 57, baseType: !62, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !120, file: !58, line: 58, baseType: !66, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !120, file: !58, line: 59, baseType: !71, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !120, file: !58, line: 60, baseType: !71, size: 64, offset: 192)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "Example_map", scope: !2, file: !22, line: 16, type: !128, isLocal: false, isDefinition: true)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !22, line: 9, size: 256, elements: !129)
!129 = !{!130, !135, !140, !141}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !128, file: !22, line: 10, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 96, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 3)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !22, line: 13, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !128, file: !22, line: 14, baseType: !71, size: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !128, file: !22, line: 15, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 768, elements: !144)
!144 = !{!145}
!145 = !DISubrange(count: 24)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !148, line: 50, type: !149, isLocal: true, isDefinition: true)
!148 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "eadf4a8bcf7ac4e7bd6d2cb666452242")
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!152, !152, !153}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(scope: null, file: !157, line: 109, type: !23, isLocal: true, isDefinition: true)
!157 = !DIFile(filename: "_build/dev/lib/honey/priv/c_boilerplates/runtime_functions.bpf.c", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "b230f5be759074326648f496f90fd18a")
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(scope: null, file: !157, line: 120, type: !23, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(scope: null, file: !157, line: 126, type: !23, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(scope: null, file: !157, line: 136, type: !23, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !148, line: 72, type: !166, isLocal: true, isDefinition: true)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !152, !153, !153, !170}
!169 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !171, line: 31, baseType: !172)
!171 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!172 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !148, line: 171, type: !175, isLocal: true, isDefinition: true)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!169, !178, !180, null}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !171, line: 27, baseType: !7)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 104, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 13)
!184 = !{i32 7, !"Dwarf Version", i32 5}
!185 = !{i32 2, !"Debug Info Version", i32 3}
!186 = !{i32 1, !"wchar_size", i32 4}
!187 = !{i32 7, !"frame-pointer", i32 2}
!188 = !{!"Homebrew clang version 15.0.7"}
!189 = distinct !DISubprogram(name: "main_func", scope: !22, file: !22, line: 40, type: !190, scopeLine: 40, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !209)
!190 = !DISubroutineType(types: !191)
!191 = !{!64, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscalls_enter_write_args", file: !22, line: 33, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syscalls_enter_write_args", file: !22, line: 19, size: 256, elements: !195)
!195 = !{!196, !198, !200, !201, !202, !203, !204, !205}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "common_type", scope: !194, file: !22, line: 25, baseType: !197, size: 16)
!197 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "common_flags", scope: !194, file: !22, line: 26, baseType: !199, size: 8, offset: 16)
!199 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "common_preempt_count", scope: !194, file: !22, line: 27, baseType: !199, size: 8, offset: 24)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "common_pid", scope: !194, file: !22, line: 28, baseType: !64, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__syscall_nr", scope: !194, file: !22, line: 29, baseType: !64, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !194, file: !22, line: 30, baseType: !7, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !194, file: !22, line: 31, baseType: !178, size: 64, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !194, file: !22, line: 32, baseType: !206, size: 64, offset: 192)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !207, line: 46, baseType: !208)
!207 = !DIFile(filename: "linuxbrew/.linuxbrew/Cellar/llvm@15/15.0.7/lib/clang/15.0.7/include/stddef.h", directory: "/home", checksumkind: CSK_MD5, checksum: "b76978376d35d5cd171876ac58ac1256")
!208 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!209 = !{!210, !211, !217, !218, !219, !259, !260, !263, !265, !270, !271, !274, !275, !276, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !315, !316, !317, !318}
!210 = !DILocalVariable(name: "ctx_arg", arg: 1, scope: !189, file: !22, line: 40, type: !192)
!211 = !DILocalVariable(name: "str_param1", scope: !189, file: !22, line: 42, type: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrFormatSpec", file: !6, line: 105, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StrFormatSpec", file: !6, line: 102, size: 16, elements: !214)
!214 = !{!215}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !213, file: !6, line: 104, baseType: !216, size: 16)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, elements: !138)
!217 = !DILocalVariable(name: "str_param2", scope: !189, file: !22, line: 43, type: !212)
!218 = !DILocalVariable(name: "str_param3", scope: !189, file: !22, line: 44, type: !212)
!219 = !DILocalVariable(name: "op_result", scope: !189, file: !22, line: 46, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpResult", file: !6, line: 100, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpResult", file: !6, line: 95, size: 1472, elements: !222)
!222 = !{!223, !257, !258}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "result_var", scope: !221, file: !6, line: 97, baseType: !224, size: 192)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "Generic", file: !6, line: 93, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Generic", file: !6, line: 89, size: 192, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !225, file: !6, line: 91, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !6, line: 52, baseType: !5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !225, file: !6, line: 92, baseType: !230, size: 128, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElixirValue", file: !6, line: 87, baseType: !231)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ElixirValue", file: !6, line: 79, size: 128, elements: !232)
!232 = !{!233, !234, !235, !237, !243, !249}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !231, file: !6, line: 81, baseType: !169, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "u_integer", scope: !231, file: !6, line: 82, baseType: !7, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "double_precision", scope: !231, file: !6, line: 83, baseType: !236, size: 64)
!236 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !231, file: !6, line: 84, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tuple", file: !6, line: 58, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", file: !6, line: 54, size: 64, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !239, file: !6, line: 56, baseType: !64, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !239, file: !6, line: 57, baseType: !64, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !231, file: !6, line: 85, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !6, line: 64, baseType: !245)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !6, line: 60, size: 64, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !245, file: !6, line: 62, baseType: !64, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !245, file: !6, line: 63, baseType: !64, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "syscalls_enter_kill_args", scope: !231, file: !6, line: 86, baseType: !250, size: 128)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_Syscalls_enter_kill_args", file: !6, line: 77, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_Syscalls_enter_kill_args", file: !6, line: 71, size: 128, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pad", scope: !251, file: !6, line: 73, baseType: !7, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pos_syscall_nr", scope: !251, file: !6, line: 74, baseType: !7, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pid", scope: !251, file: !6, line: 75, baseType: !7, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "pos_sig", scope: !251, file: !6, line: 76, baseType: !7, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !221, file: !6, line: 98, baseType: !64, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "exception_msg", scope: !221, file: !6, line: 99, baseType: !23, size: 1200, offset: 224)
!259 = !DILocalVariable(name: "zero", scope: !189, file: !22, line: 48, type: !64)
!260 = !DILocalVariable(name: "string_pool", scope: !189, file: !22, line: 49, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4000, elements: !76)
!263 = !DILocalVariable(name: "string_pool_index", scope: !189, file: !22, line: 56, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!265 = !DILocalVariable(name: "heap", scope: !189, file: !22, line: 68, type: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !224, size: 19200, elements: !268)
!268 = !{!269}
!269 = !DISubrange(count: 100)
!270 = !DILocalVariable(name: "heap_index", scope: !189, file: !22, line: 75, type: !264)
!271 = !DILocalVariable(name: "tuple_pool", scope: !189, file: !22, line: 83, type: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16000, elements: !76)
!274 = !DILocalVariable(name: "tuple_pool_index", scope: !189, file: !22, line: 90, type: !264)
!275 = !DILocalVariable(name: "helper_var_1922", scope: !189, file: !22, line: 103, type: !224)
!276 = !DILocalVariable(name: "helper_var_1986", scope: !189, file: !22, line: 108, type: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!278 = !DILocalVariable(name: "helper_var_2050", scope: !189, file: !22, line: 110, type: !224)
!279 = !DILocalVariable(name: "helper_var_1794", scope: !189, file: !22, line: 112, type: !224)
!280 = !DILocalVariable(name: "helper_var_1858", scope: !189, file: !22, line: 113, type: !224)
!281 = !DILocalVariable(name: "entry_0_1_", scope: !189, file: !22, line: 154, type: !224)
!282 = !DILocalVariable(name: "helper_var_2370", scope: !189, file: !22, line: 163, type: !224)
!283 = !DILocalVariable(name: "helper_var_2434", scope: !189, file: !22, line: 168, type: !277)
!284 = !DILocalVariable(name: "helper_var_2498", scope: !189, file: !22, line: 170, type: !224)
!285 = !DILocalVariable(name: "helper_var_2242", scope: !189, file: !22, line: 172, type: !224)
!286 = !DILocalVariable(name: "helper_var_2306", scope: !189, file: !22, line: 173, type: !224)
!287 = !DILocalVariable(name: "entry_1_2_", scope: !189, file: !22, line: 214, type: !224)
!288 = !DILocalVariable(name: "helper_var_2818", scope: !189, file: !22, line: 223, type: !224)
!289 = !DILocalVariable(name: "helper_var_2882", scope: !189, file: !22, line: 228, type: !277)
!290 = !DILocalVariable(name: "helper_var_2946", scope: !189, file: !22, line: 230, type: !224)
!291 = !DILocalVariable(name: "helper_var_2690", scope: !189, file: !22, line: 232, type: !224)
!292 = !DILocalVariable(name: "helper_var_2754", scope: !189, file: !22, line: 233, type: !224)
!293 = !DILocalVariable(name: "entry_2_3_", scope: !189, file: !22, line: 274, type: !224)
!294 = !DILocalVariable(name: "helper_var_3074", scope: !189, file: !22, line: 282, type: !224)
!295 = !DILocalVariable(name: "helper_var_3138", scope: !189, file: !22, line: 285, type: !224)
!296 = !DILocalVariable(name: "helper_var_3202", scope: !189, file: !22, line: 286, type: !224)
!297 = !DILocalVariable(name: "helper_var_3266", scope: !189, file: !22, line: 292, type: !64)
!298 = !DILocalVariable(name: "helper_var_3330", scope: !189, file: !22, line: 293, type: !224)
!299 = !DILocalVariable(name: "helper_var_3394", scope: !189, file: !22, line: 296, type: !224)
!300 = !DILocalVariable(name: "helper_var_3458", scope: !189, file: !22, line: 299, type: !224)
!301 = !DILocalVariable(name: "helper_var_3522", scope: !189, file: !22, line: 300, type: !224)
