; ModuleID = '/home/vinicius/honey-potion/test_cases/lib/src/Honey_List.bpf.c'
source_filename = "/home/vinicius/honey-potion/test_cases/lib/src/Honey_List.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.Tuple = type { i32, i32 }
%struct.Generic = type { i32, %union.ElixirValue }
%union.ElixirValue = type { i64, [8 x i8] }
%struct.OpResult = type { %struct.Generic, i32, [150 x i8] }

@LICENSE = dso_local global [13 x i8] c"Dual BSD/GPL\00", section "license", align 1, !dbg !0
@string_pool_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !60
@.str = private unnamed_addr constant [150 x i8] c"(UnexpectedBehavior) something wrong happened inside the Elixir runtime for eBPF. (can't access string pool, main function).\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 4, !dbg !20
@string_pool_index_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !82

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LICENSE", scope: !2, file: !22, line: 24, type: !149, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Homebrew clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/vinicius/honey-potion/test_cases/lib/src/Honey_List.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "ddec2e80f823960d29426809afaf1214")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", file: !6, line: 40, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: ".elixir_ls/build/test/lib/honey/priv/c_boilerplates/runtime_generic.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "699e26b6150612b5cee9098b6ccdafaf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "INVALID_TYPE", value: 0)
!10 = !DIEnumerator(name: "PATTERN_M", value: 1)
!11 = !DIEnumerator(name: "INTEGER", value: 2)
!12 = !DIEnumerator(name: "DOUBLE", value: 3)
!13 = !DIEnumerator(name: "STRING", value: 4)
!14 = !DIEnumerator(name: "ATOM", value: 5)
!15 = !DIEnumerator(name: "TUPLE", value: 6)
!16 = !DIEnumerator(name: "LIST", value: 7)
!17 = !DIEnumerator(name: "STRUCT", value: 8)
!18 = !DIEnumerator(name: "TYPE_Syscalls_enter_kill_arg", value: 9)
!19 = !{!0, !20, !27, !29, !34, !39, !44, !46, !48, !50, !52, !54, !56, !58, !60, !82, !90, !102, !110, !122, !130, !139}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(scope: null, file: !22, line: 41, type: !23, isLocal: true, isDefinition: true)
!22 = !DIFile(filename: "src/Honey_List.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "ddec2e80f823960d29426809afaf1214")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1200, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 150)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !22, line: 48, type: !23, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !22, line: 53, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 4)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !22, line: 54, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !22, line: 55, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 5)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !22, line: 60, type: !23, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !22, line: 67, type: !23, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !22, line: 98, type: !23, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !22, line: 115, type: !23, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !22, line: 198, type: !23, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !22, line: 279, type: !23, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(scope: null, file: !22, line: 283, type: !23, isLocal: true, isDefinition: true)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !22, line: 315, type: !23, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(name: "string_pool_map", scope: !2, file: !62, line: 19, type: !63, isLocal: false, isDefinition: true)
!62 = !DIFile(filename: ".elixir_ls/build/test/lib/honey/priv/c_boilerplates/runtime_structures.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "c2bd38c05cd37ff863c88000051eef3c")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 13, size: 256, elements: !64)
!64 = !{!65, !69, !74, !77}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !63, file: !62, line: 15, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 192, elements: !37)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !63, file: !62, line: 16, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 32, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !63, file: !62, line: 17, baseType: !75, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, elements: !32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !63, file: !62, line: 18, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 16000, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 500)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(name: "string_pool_index_map", scope: !2, file: !62, line: 27, type: !84, isLocal: false, isDefinition: true)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 21, size: 256, elements: !85)
!85 = !{!86, !87, !88, !89}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !62, line: 23, baseType: !66, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !84, file: !62, line: 24, baseType: !70, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !84, file: !62, line: 25, baseType: !75, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !84, file: !62, line: 26, baseType: !75, size: 64, offset: 192)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "tuple_pool_map", scope: !2, file: !62, line: 36, type: !92, isLocal: false, isDefinition: true)
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 30, size: 256, elements: !93)
!93 = !{!94, !95, !96, !97}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !92, file: !62, line: 32, baseType: !66, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !92, file: !62, line: 33, baseType: !70, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !92, file: !62, line: 34, baseType: !75, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !92, file: !62, line: 35, baseType: !98, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64000, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 2000)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(name: "tuple_pool_index_map", scope: !2, file: !62, line: 44, type: !104, isLocal: false, isDefinition: true)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 38, size: 256, elements: !105)
!105 = !{!106, !107, !108, !109}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !104, file: !62, line: 40, baseType: !66, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !104, file: !62, line: 41, baseType: !70, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !104, file: !62, line: 42, baseType: !75, size: 64, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !104, file: !62, line: 43, baseType: !75, size: 64, offset: 192)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "heap_map", scope: !2, file: !62, line: 53, type: !112, isLocal: false, isDefinition: true)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 47, size: 256, elements: !113)
!113 = !{!114, !115, !116, !117}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !112, file: !62, line: 49, baseType: !66, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !112, file: !62, line: 50, baseType: !70, size: 64, offset: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !112, file: !62, line: 51, baseType: !75, size: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !112, file: !62, line: 52, baseType: !118, size: 64, offset: 192)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 76800, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 2400)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "heap_index_map", scope: !2, file: !62, line: 61, type: !124, isLocal: false, isDefinition: true)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !62, line: 55, size: 256, elements: !125)
!125 = !{!126, !127, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !124, file: !62, line: 57, baseType: !66, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !124, file: !62, line: 58, baseType: !70, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !124, file: !62, line: 59, baseType: !75, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !124, file: !62, line: 60, baseType: !75, size: 64, offset: 192)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !132, line: 50, type: !133, isLocal: true, isDefinition: true)
!132 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "eadf4a8bcf7ac4e7bd6d2cb666452242")
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !136, !137}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !132, line: 171, type: !141, isLocal: true, isDefinition: true)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !145, !147, null}
!144 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !148, line: 27, baseType: !7)
!148 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 104, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 13)
!152 = !{i32 7, !"Dwarf Version", i32 5}
!153 = !{i32 2, !"Debug Info Version", i32 3}
!154 = !{i32 1, !"wchar_size", i32 4}
!155 = !{i32 7, !"frame-pointer", i32 2}
!156 = !{!"Homebrew clang version 15.0.7"}
!157 = distinct !DISubprogram(name: "main_func", scope: !22, file: !22, line: 29, type: !158, scopeLine: 29, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !169)
!158 = !DISubroutineType(types: !159)
!159 = !{!68, !160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscalls_enter_kill_args", file: !22, line: 22, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syscalls_enter_kill_args", file: !22, line: 11, size: 256, elements: !163)
!163 = !{!164, !166, !167, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !162, file: !22, line: 17, baseType: !165, size: 64)
!165 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "syscall_nr", scope: !162, file: !22, line: 19, baseType: !144, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !162, file: !22, line: 20, baseType: !144, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !162, file: !22, line: 21, baseType: !144, size: 64, offset: 192)
!169 = !{!170, !171, !179, !180, !181, !221, !222, !225, !227, !232, !233, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !248, !249, !252, !253, !256, !257, !258, !261, !262, !265, !266, !267, !270, !272, !273, !278, !279, !280}
!170 = !DILocalVariable(name: "ctx_arg", arg: 1, scope: !157, file: !22, line: 29, type: !160)
!171 = !DILocalVariable(name: "str_param1", scope: !157, file: !22, line: 31, type: !172)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrFormatSpec", file: !6, line: 105, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StrFormatSpec", file: !6, line: 102, size: 16, elements: !174)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !173, file: !6, line: 104, baseType: !176, size: 16)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, elements: !177)
!177 = !{!178}
!178 = !DISubrange(count: 2)
!179 = !DILocalVariable(name: "str_param2", scope: !157, file: !22, line: 32, type: !172)
!180 = !DILocalVariable(name: "str_param3", scope: !157, file: !22, line: 33, type: !172)
!181 = !DILocalVariable(name: "op_result", scope: !157, file: !22, line: 35, type: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpResult", file: !6, line: 100, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpResult", file: !6, line: 95, size: 1472, elements: !184)
!184 = !{!185, !219, !220}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "result_var", scope: !183, file: !6, line: 97, baseType: !186, size: 192)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "Generic", file: !6, line: 93, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Generic", file: !6, line: 89, size: 192, elements: !188)
!188 = !{!189, !191}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !187, file: !6, line: 91, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !6, line: 52, baseType: !5)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !187, file: !6, line: 92, baseType: !192, size: 128, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElixirValue", file: !6, line: 87, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ElixirValue", file: !6, line: 79, size: 128, elements: !194)
!194 = !{!195, !196, !197, !199, !205, !211}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !193, file: !6, line: 81, baseType: !144, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "u_integer", scope: !193, file: !6, line: 82, baseType: !7, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "double_precision", scope: !193, file: !6, line: 83, baseType: !198, size: 64)
!198 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !193, file: !6, line: 84, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tuple", file: !6, line: 58, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", file: !6, line: 54, size: 64, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !201, file: !6, line: 56, baseType: !68, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !201, file: !6, line: 57, baseType: !68, size: 32, offset: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !193, file: !6, line: 85, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !6, line: 64, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !6, line: 60, size: 64, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !207, file: !6, line: 62, baseType: !68, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !207, file: !6, line: 63, baseType: !68, size: 32, offset: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "syscalls_enter_kill_args", scope: !193, file: !6, line: 86, baseType: !212, size: 128)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_Syscalls_enter_kill_args", file: !6, line: 77, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_Syscalls_enter_kill_args", file: !6, line: 71, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pad", scope: !213, file: !6, line: 73, baseType: !7, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pos_syscall_nr", scope: !213, file: !6, line: 74, baseType: !7, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pid", scope: !213, file: !6, line: 75, baseType: !7, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pos_sig", scope: !213, file: !6, line: 76, baseType: !7, size: 32, offset: 96)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !183, file: !6, line: 98, baseType: !68, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "exception_msg", scope: !183, file: !6, line: 99, baseType: !23, size: 1200, offset: 224)
!221 = !DILocalVariable(name: "zero", scope: !157, file: !22, line: 37, type: !68)
!222 = !DILocalVariable(name: "string_pool", scope: !157, file: !22, line: 38, type: !223)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4000, elements: !80)
!225 = !DILocalVariable(name: "string_pool_index", scope: !157, file: !22, line: 45, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!227 = !DILocalVariable(name: "heap", scope: !157, file: !22, line: 57, type: !228)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 19200, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 100)
!232 = !DILocalVariable(name: "heap_index", scope: !157, file: !22, line: 64, type: !226)
!233 = !DILocalVariable(name: "tuple_pool", scope: !157, file: !22, line: 72, type: !234)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16000, elements: !80)
!236 = !DILocalVariable(name: "tuple_pool_index", scope: !157, file: !22, line: 79, type: !226)
!237 = !DILocalVariable(name: "helper_var_1607", scope: !157, file: !22, line: 94, type: !186)
!238 = !DILocalVariable(name: "helper_var_1671", scope: !157, file: !22, line: 104, type: !186)
!239 = !DILocalVariable(name: "helper_var_1735", scope: !157, file: !22, line: 105, type: !186)
!240 = !DILocalVariable(name: "helper_var_1799", scope: !157, file: !22, line: 133, type: !186)
!241 = !DILocalVariable(name: "helper_var_1863", scope: !157, file: !22, line: 149, type: !186)
!242 = !DILocalVariable(name: "helper_var_1927", scope: !157, file: !22, line: 165, type: !186)
!243 = !DILocalVariable(name: "helper_var_1991", scope: !157, file: !22, line: 180, type: !186)
!244 = !DILocalVariable(name: "helper_var_2055", scope: !157, file: !22, line: 201, type: !186)
!245 = !DILocalVariable(name: "helper_var_2119", scope: !246, file: !22, line: 203, type: !7)
!246 = distinct !DILexicalBlock(scope: !247, file: !22, line: 202, column: 99)
!247 = distinct !DILexicalBlock(scope: !157, file: !22, line: 202, column: 4)
!248 = !DILocalVariable(name: "label_2183", scope: !157, file: !22, line: 215, type: !186)
!249 = !DILocalVariable(name: "helper_var_2247", scope: !250, file: !22, line: 217, type: !7)
!250 = distinct !DILexicalBlock(scope: !251, file: !22, line: 216, column: 103)
!251 = distinct !DILexicalBlock(scope: !157, file: !22, line: 216, column: 4)
!252 = !DILocalVariable(name: "helper_var_2311", scope: !157, file: !22, line: 228, type: !186)
!253 = !DILocalVariable(name: "helper_var_2375", scope: !254, file: !22, line: 230, type: !7)
!254 = distinct !DILexicalBlock(scope: !255, file: !22, line: 229, column: 89)
!255 = distinct !DILexicalBlock(scope: !157, file: !22, line: 229, column: 4)
!256 = !DILocalVariable(name: "any_tuple_2_", scope: !157, file: !22, line: 241, type: !186)
!257 = !DILocalVariable(name: "label_2439", scope: !157, file: !22, line: 243, type: !186)
!258 = !DILocalVariable(name: "helper_var_2503", scope: !259, file: !22, line: 245, type: !7)
!259 = distinct !DILexicalBlock(scope: !260, file: !22, line: 244, column: 93)
!260 = distinct !DILexicalBlock(scope: !157, file: !22, line: 244, column: 4)
!261 = !DILocalVariable(name: "helper_var_2631", scope: !157, file: !22, line: 273, type: !186)
!262 = !DILocalVariable(name: "helper_var_2695", scope: !263, file: !22, line: 275, type: !7)
!263 = distinct !DILexicalBlock(scope: !264, file: !22, line: 274, column: 100)
!264 = distinct !DILexicalBlock(scope: !157, file: !22, line: 274, column: 4)
!265 = !DILocalVariable(name: "x_3_", scope: !157, file: !22, line: 286, type: !186)
