; ModuleID = '/home/vinicius/honey-potion/test_cases/lib/src/Integer_String_Pattern_Matching.bpf.c'
source_filename = "/home/vinicius/honey-potion/test_cases/lib/src/Integer_String_Pattern_Matching.bpf.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.anon = type { ptr, ptr, ptr, ptr }
%struct.anon.0 = type { ptr, ptr, ptr, ptr }
%struct.anon.1 = type { ptr, ptr, ptr, ptr }
%struct.anon.2 = type { ptr, ptr, ptr, ptr }
%struct.anon.3 = type { ptr, ptr, ptr, ptr }
%struct.anon.4 = type { ptr, ptr, ptr, ptr }
%struct.OpResult = type { %struct.Generic, i32, [150 x i8] }
%struct.Generic = type { i32, %union.ElixirValue }
%union.ElixirValue = type { i64, [8 x i8] }

@LICENSE = dso_local global [13 x i8] c"Dual BSD/GPL\00", section "license", align 1, !dbg !0
@string_pool_map = dso_local global %struct.anon zeroinitializer, section ".maps", align 8, !dbg !56
@.str = private unnamed_addr constant [150 x i8] c"(UnexpectedBehavior) something wrong happened inside the Elixir runtime for eBPF. (can't access string pool, main function).\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00", align 4, !dbg !20
@string_pool_index_map = dso_local global %struct.anon.0 zeroinitializer, section ".maps", align 8, !dbg !78

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "LICENSE", scope: !2, file: !22, line: 25, type: !145, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Homebrew clang version 15.0.7", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !19, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/vinicius/honey-potion/test_cases/lib/src/Integer_String_Pattern_Matching.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "02246c403db873c70c8a03f299734205")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Type", file: !6, line: 40, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: ".elixir_ls/build/test/lib/honey/priv/c_boilerplates/runtime_generic.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "699e26b6150612b5cee9098b6ccdafaf")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!9 = !DIEnumerator(name: "INVALID_TYPE", value: 0)
!10 = !DIEnumerator(name: "PATTERN_M", value: 1)
!11 = !DIEnumerator(name: "INTEGER", value: 2)
!12 = !DIEnumerator(name: "DOUBLE", value: 3)
!13 = !DIEnumerator(name: "STRING", value: 4)
!14 = !DIEnumerator(name: "ATOM", value: 5)
!15 = !DIEnumerator(name: "TUPLE", value: 6)
!16 = !DIEnumerator(name: "LIST", value: 7)
!17 = !DIEnumerator(name: "STRUCT", value: 8)
!18 = !DIEnumerator(name: "TYPE_Syscalls_enter_kill_arg", value: 9)
!19 = !{!0, !20, !27, !29, !34, !39, !44, !46, !48, !50, !52, !54, !56, !78, !86, !98, !106, !118, !126, !135}
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(scope: null, file: !22, line: 42, type: !23, isLocal: true, isDefinition: true)
!22 = !DIFile(filename: "src/Integer_String_Pattern_Matching.bpf.c", directory: "/home/vinicius/honey-potion/test_cases/lib", checksumkind: CSK_MD5, checksum: "02246c403db873c70c8a03f299734205")
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 1200, elements: !25)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !{!26}
!26 = !DISubrange(count: 150)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !22, line: 49, type: !23, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !22, line: 54, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 32, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 4)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !22, line: 55, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 48, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 6)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !22, line: 56, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 40, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 5)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !22, line: 61, type: !23, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !22, line: 68, type: !23, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !22, line: 95, type: !23, isLocal: true, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(scope: null, file: !22, line: 109, type: !23, isLocal: true, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(scope: null, file: !22, line: 114, type: !31, isLocal: true, isDefinition: true)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(scope: null, file: !22, line: 215, type: !23, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(name: "string_pool_map", scope: !2, file: !58, line: 19, type: !59, isLocal: false, isDefinition: true)
!58 = !DIFile(filename: ".elixir_ls/build/test/lib/honey/priv/c_boilerplates/runtime_structures.bpf.h", directory: "/home/vinicius/honey-potion/test_cases", checksumkind: CSK_MD5, checksum: "c2bd38c05cd37ff863c88000051eef3c")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 13, size: 256, elements: !60)
!60 = !{!61, !65, !70, !73}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !59, file: !58, line: 15, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 192, elements: !37)
!64 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !59, file: !58, line: 16, baseType: !66, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 32, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 1)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !59, file: !58, line: 17, baseType: !71, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !59, file: !58, line: 18, baseType: !74, size: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 16000, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 500)
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(name: "string_pool_index_map", scope: !2, file: !58, line: 27, type: !80, isLocal: false, isDefinition: true)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 21, size: 256, elements: !81)
!81 = !{!82, !83, !84, !85}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !80, file: !58, line: 23, baseType: !62, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !80, file: !58, line: 24, baseType: !66, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !80, file: !58, line: 25, baseType: !71, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !80, file: !58, line: 26, baseType: !71, size: 64, offset: 192)
!86 = !DIGlobalVariableExpression(var: !87, expr: !DIExpression())
!87 = distinct !DIGlobalVariable(name: "tuple_pool_map", scope: !2, file: !58, line: 36, type: !88, isLocal: false, isDefinition: true)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 30, size: 256, elements: !89)
!89 = !{!90, !91, !92, !93}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !88, file: !58, line: 32, baseType: !62, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !88, file: !58, line: 33, baseType: !66, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !88, file: !58, line: 34, baseType: !71, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !88, file: !58, line: 35, baseType: !94, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 64000, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 2000)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "tuple_pool_index_map", scope: !2, file: !58, line: 44, type: !100, isLocal: false, isDefinition: true)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 38, size: 256, elements: !101)
!101 = !{!102, !103, !104, !105}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !100, file: !58, line: 40, baseType: !62, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !100, file: !58, line: 41, baseType: !66, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !100, file: !58, line: 42, baseType: !71, size: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !100, file: !58, line: 43, baseType: !71, size: 64, offset: 192)
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "heap_map", scope: !2, file: !58, line: 53, type: !108, isLocal: false, isDefinition: true)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 47, size: 256, elements: !109)
!109 = !{!110, !111, !112, !113}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !58, line: 49, baseType: !62, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !108, file: !58, line: 50, baseType: !66, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !108, file: !58, line: 51, baseType: !71, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !108, file: !58, line: 52, baseType: !114, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 76800, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 2400)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "heap_index_map", scope: !2, file: !58, line: 61, type: !120, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 55, size: 256, elements: !121)
!121 = !{!122, !123, !124, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !120, file: !58, line: 57, baseType: !62, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !120, file: !58, line: 58, baseType: !66, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !120, file: !58, line: 59, baseType: !71, size: 64, offset: 128)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !120, file: !58, line: 60, baseType: !71, size: 64, offset: 192)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !128, line: 50, type: !129, isLocal: true, isDefinition: true)
!128 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "eadf4a8bcf7ac4e7bd6d2cb666452242")
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!132, !132, !133}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!135 = !DIGlobalVariableExpression(var: !136, expr: !DIExpression())
!136 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !128, line: 171, type: !137, isLocal: true, isDefinition: true)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!140, !141, !143, null}
!140 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !144, line: 27, baseType: !7)
!144 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 104, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 13)
!148 = !{i32 7, !"Dwarf Version", i32 5}
!149 = !{i32 2, !"Debug Info Version", i32 3}
!150 = !{i32 1, !"wchar_size", i32 4}
!151 = !{i32 7, !"frame-pointer", i32 2}
!152 = !{!"Homebrew clang version 15.0.7"}
!153 = distinct !DISubprogram(name: "main_func", scope: !22, file: !22, line: 30, type: !154, scopeLine: 30, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !170)
!154 = !DISubroutineType(types: !155)
!155 = !{!64, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "syscalls_enter_args", file: !22, line: 23, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "syscalls_enter_args", file: !22, line: 11, size: 512, elements: !159)
!159 = !{!160, !162, !164, !165, !166, !167}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "common_type", scope: !158, file: !22, line: 17, baseType: !161, size: 16)
!161 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "common_flags", scope: !158, file: !22, line: 18, baseType: !163, size: 8, offset: 16)
!163 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "common_preempt_count", scope: !158, file: !22, line: 19, baseType: !163, size: 8, offset: 24)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "common_pid", scope: !158, file: !22, line: 20, baseType: !64, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !158, file: !22, line: 21, baseType: !140, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !158, file: !22, line: 22, baseType: !168, size: 384, offset: 128)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 384, elements: !37)
!169 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!170 = !{!171, !172, !180, !181, !182, !222, !223, !226, !228, !233, !234, !237, !238, !239, !240, !241, !242, !243, !248, !249, !250, !251, !252, !253, !258, !259, !260, !261}
!171 = !DILocalVariable(name: "ctx_arg", arg: 1, scope: !153, file: !22, line: 30, type: !156)
!172 = !DILocalVariable(name: "str_param1", scope: !153, file: !22, line: 32, type: !173)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "StrFormatSpec", file: !6, line: 105, baseType: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StrFormatSpec", file: !6, line: 102, size: 16, elements: !175)
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !174, file: !6, line: 104, baseType: !177, size: 16)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 16, elements: !178)
!178 = !{!179}
!179 = !DISubrange(count: 2)
!180 = !DILocalVariable(name: "str_param2", scope: !153, file: !22, line: 33, type: !173)
!181 = !DILocalVariable(name: "str_param3", scope: !153, file: !22, line: 34, type: !173)
!182 = !DILocalVariable(name: "op_result", scope: !153, file: !22, line: 36, type: !183)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpResult", file: !6, line: 100, baseType: !184)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpResult", file: !6, line: 95, size: 1472, elements: !185)
!185 = !{!186, !220, !221}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "result_var", scope: !184, file: !6, line: 97, baseType: !187, size: 192)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "Generic", file: !6, line: 93, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Generic", file: !6, line: 89, size: 192, elements: !189)
!189 = !{!190, !192}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !188, file: !6, line: 91, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "Type", file: !6, line: 52, baseType: !5)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !188, file: !6, line: 92, baseType: !193, size: 128, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "ElixirValue", file: !6, line: 87, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "ElixirValue", file: !6, line: 79, size: 128, elements: !195)
!195 = !{!196, !197, !198, !200, !206, !212}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "integer", scope: !194, file: !6, line: 81, baseType: !140, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "u_integer", scope: !194, file: !6, line: 82, baseType: !7, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "double_precision", scope: !194, file: !6, line: 83, baseType: !199, size: 64)
!199 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tuple", scope: !194, file: !6, line: 84, baseType: !201, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "Tuple", file: !6, line: 58, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tuple", file: !6, line: 54, size: 64, elements: !203)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !202, file: !6, line: 56, baseType: !64, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !202, file: !6, line: 57, baseType: !64, size: 32, offset: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !194, file: !6, line: 85, baseType: !207, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "String", file: !6, line: 64, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", file: !6, line: 60, size: 64, elements: !209)
!209 = !{!210, !211}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !208, file: !6, line: 62, baseType: !64, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !208, file: !6, line: 63, baseType: !64, size: 32, offset: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "syscalls_enter_kill_args", scope: !194, file: !6, line: 86, baseType: !213, size: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "struct_Syscalls_enter_kill_args", file: !6, line: 77, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "struct_Syscalls_enter_kill_args", file: !6, line: 71, size: 128, elements: !215)
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pad", scope: !214, file: !6, line: 73, baseType: !7, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "pos_syscall_nr", scope: !214, file: !6, line: 74, baseType: !7, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pos_pid", scope: !214, file: !6, line: 75, baseType: !7, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "pos_sig", scope: !214, file: !6, line: 76, baseType: !7, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "exception", scope: !184, file: !6, line: 98, baseType: !64, size: 32, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "exception_msg", scope: !184, file: !6, line: 99, baseType: !23, size: 1200, offset: 224)
!222 = !DILocalVariable(name: "zero", scope: !153, file: !22, line: 38, type: !64)
!223 = !DILocalVariable(name: "string_pool", scope: !153, file: !22, line: 39, type: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 4000, elements: !76)
!226 = !DILocalVariable(name: "string_pool_index", scope: !153, file: !22, line: 46, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!228 = !DILocalVariable(name: "heap", scope: !153, file: !22, line: 58, type: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 19200, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 100)
!233 = !DILocalVariable(name: "heap_index", scope: !153, file: !22, line: 65, type: !227)
!234 = !DILocalVariable(name: "tuple_pool", scope: !153, file: !22, line: 73, type: !235)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 16000, elements: !76)
!237 = !DILocalVariable(name: "tuple_pool_index", scope: !153, file: !22, line: 80, type: !227)
!238 = !DILocalVariable(name: "helper_var_3720", scope: !153, file: !22, line: 92, type: !187)
!239 = !DILocalVariable(name: "len_helper_var_3912", scope: !153, file: !22, line: 106, type: !7)
!240 = !DILocalVariable(name: "end_helper_var_3912", scope: !153, file: !22, line: 107, type: !7)
!241 = !DILocalVariable(name: "helper_var_3848", scope: !153, file: !22, line: 117, type: !187)
!242 = !DILocalVariable(name: "helper_var_3976", scope: !153, file: !22, line: 126, type: !207)
!243 = !DILocalVariable(name: "____fmt", scope: !244, file: !22, line: 157, type: !245)
!244 = distinct !DILexicalBlock(scope: !153, file: !22, line: 157, column: 1)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 64, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 8)
!248 = !DILocalVariable(name: "helper_var_4040", scope: !153, file: !22, line: 158, type: !187)
!249 = !DILocalVariable(name: "len_helper_var_4232", scope: !153, file: !22, line: 162, type: !7)
!250 = !DILocalVariable(name: "end_helper_var_4232", scope: !153, file: !22, line: 163, type: !7)
!251 = !DILocalVariable(name: "helper_var_4168", scope: !153, file: !22, line: 173, type: !187)
!252 = !DILocalVariable(name: "helper_var_4296", scope: !153, file: !22, line: 182, type: !207)
!253 = !DILocalVariable(name: "____fmt", scope: !254, file: !22, line: 221, type: !255)
!254 = distinct !DILexicalBlock(scope: !153, file: !22, line: 221, column: 3)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 56, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 7)
!258 = !DILabel(scope: !153, name: "label_3656", file: !22, line: 99)
!259 = !DILabel(scope: !153, name: "label_3784", file: !22, line: 150)
!260 = !DILabel(scope: !153, name: "label_4104", file: !22, line: 206)
!261 = !DILabel(scope: !153, name: "CATCH", file: !22, line: 220)
!262 = !DILocation(line: 32, column: 15, scope: !153)
!263 = !DILocation(line: 33, column: 15, scope: !153)
!264 = !DILocation(line: 34, column: 15, scope: !153)
!265 = !DILocation(line: 0, scope: !153)
!266 = !DILocation(line: 36, column: 1, scope: !153)
!267 = !DILocation(line: 36, column: 10, scope: !153)
!268 = !DILocation(line: 38, column: 1, scope: !153)
!269 = !DILocation(line: 38, column: 5, scope: !153)
!270 = !{!271, !271, i64 0}
!271 = !{!"int", !272, i64 0}
!272 = !{!"omnipotent char", !273, i64 0}
!273 = !{!"Simple C/C++ TBAA"}
!274 = !DILocation(line: 39, column: 40, scope: !153)
!275 = !DILocation(line: 40, column: 6, scope: !276)
!276 = distinct !DILexicalBlock(scope: !153, file: !22, line: 40, column: 5)
!277 = !DILocation(line: 40, column: 5, scope: !153)
